[
  {
    "key": "A",
    "description": "A: is a physical drive on older PC or IBM compatible computers, the A: drive denotes the 3.5-inch or 5.25-inch floppy disk drive. Often, the A: drive is configured in BIOS setup as the first bootable drive on IBM-compatible computers.",
    "alias": [
      "a"
    ]
  },
  {
    "key": "A*",
    "description": "A* (pronounced 'A-star') is an algorithm for pathfinding and traversing a graph data structure. It was developed in 1968 by researchers at Stanford University and is widely used today―notably in computer games. When a video game character moves and navigates around obstacles or terrain, the A* algorithm was likely used to calculate the path.",
    "alias": [
      "a*",
      "A-star"
    ]
  },
  {
    "key": "A+",
    "description": "The A+ or A-Plus is a certification program created by CompTIA and administrated by Drake Parametric covering both hardware and software for the IBM compatible and Macintosh platforms. This certification is usually the minimum requirement for most computer technical support jobs. Up until 2011 the A+ certification was a lifetime certification; the certification now must be renewed every three years.",
    "alias": [
      "a+",
      "A-plus"
    ]
  },
  {
    "key": "A-0",
    "description": "Short for Arithmetic Language version 0, A-0 was the first electronic computer compiler written by Grace Hopper in 1951 for the UNIVAC I computer.",
    "alias": [
      "a-0",
      "Arithmetic Language version 0"
    ]
  },
  {
    "key": "A2P",
    "description": "The a2p utility takes an awk script specified on the command line and produces a comparable perl script on standard output.",
    "alias": [
      "a2p",
      "Linux a2p command"
    ]
  },
  {
    "key": "A4 Paper",
    "description": "A4 is an international standard paper size defined by ISO (standard ISO 216). Its dimensions are 210 x 297 mm, or 8.27 x 11.69 inches. Its height-to-width aspect ratio is approximately the square root of 2 (1.414) to one.",
    "alias": [
      "a4 paper"
    ]
  },
  {
    "key": "A4 Processor",
    "description": "The Apple A4 processor is a type processor known as a system-on-a-chip, where a CPU and a GPU are combined onto a single processing chip. It combines the general processing power of an ARM Cortex-A8 CPU with the graphical processing power of a PowerVR GPU. The Apple A4 was originally designed and introduced by Apple on January 27, 2010. Samsung manufactured the processor for Apple.",
    "alias": [
      "a4 processor"
    ]
  },
  {
    "key": "A4Tech",
    "description": "Founded in 1987, A4Tech, headquartered in Taipei, Taiwan is a global leader in the computer peripheral field. It's products include: keyboards, mice, PC cams, hubs, and headsets.",
    "alias": [
      "A4Tech"
    ]
  },
  {
    "key": "A20",
    "description": "A20 is the 21st memory address line on 80286 and later processors that allow real mode software to gain access to high memory or area of memory beyond the first megabyte. With MS-DOS and early versions of Windows, this technique of accessing the high memory area was done using an A20 handler. For example, you could load the himem.sys in the config.sys file and use the DOS=HIGH,UMB line to get access to the computers high memory.",
    "alias": [
      "a20",
      "a20 handler",
      "a20 line"
    ]
  },
  {
    "key": "Amiga",
    "description": "",
    "alias": [
      "A500",
      "A600",
      "A1000",
      "A1200",
      "A2000",
      "A3000",
      "A4000",
      "Amiga"
    ]
  },
  {
    "key": "Anti-aliasing",
    "description": " Sometimes abbreviated as AA, anti-aliasing is a term used to describe the software process of making the edges of graphics objects or fonts smoother. Accomplished by adding additional pixels in-between the edges of an object and its background. Anti-aliasing improves the appearance of polygon edges, so they are not 'jagged' but are smoothed out on the screen.",
    "alias": [
      "AA",
      "Anti-aliasing"
    ]
  },
  {
    "key": "triple-A",
    "description": "With computer gaming, triple-A or AAA describes a game developed by a large publisher who has access to millions of dollars to spend on development. For example, a game like Grand Theft Auto V from Rockstar Games, which took over $250 million for development, is an example of an AAA game.",
    "alias": [
      "AA",
      "Triple-A"
    ]
  },
  {
    "key": "Association for the Advancement of Artificial Intelligence",
    "description": "Founded in 1979, AAAI stands for the Association for the Advancement of Artificial Intelligence. AAAI is a nonprofit society created to advance the understanding of the inner workings of artificial intelligence to practitioners of AI. They hold several events every year to teach and train AI practitioners about current and future developments in the field. AAAI is also actively working on increasing the public's understanding of AI.",
    "alias": [
      "Association for the Advancement of Artificial Intelligence",
      "AAAI"
    ]
  },
  {
    "key": "Advanced Audio Coding",
    "description": "Short for Advanced Audio Coding, AAC is a codec with better quality and compression than the popular MP3 format. AAC is the default codec Apple iTunes uses when saving audio CDs to your computer.",
    "alias" : [
      "Advanced Audio Coding",
      "AAC"
    ]
  },
  {
    "key": "Aaeon",
    "description": "Founded in 1992, Aaeon is a Taiwan-based manufacturer of OEM/ODM industrial PCs. Its product line includes industrial PCs, rugged tablet PCs, automation controllers and software, embedded single board computers, embedded controllers, network appliance and flat-panel PCs.",
    "alias" : [
      "Aaeon"
    ]
  },
  {
    "key": "Anti-aliasing filter",
    "description": "An AA filter or anti-aliasing filter is a filter used before a signal sampler, to restrict the bandwidth of a signal to approximately satisfy the sampling theorem. In the case of optical image sampling, as by image sensors in digital cameras, the anti-aliasing filter is also known as an AA filter, blur filter, or optical low-pass filter.",
    "alias" : [
      "Anti-aliasing filter",
      "AA Filter"
    ]
  },
  {
    "key": "Automatic acoustic management",
    "description": "Short for automatic acoustic management, AAM is a feature found on new IDE and SATA hard drives that slows the rate at which the hard drive read heads move. Although this technique significantly reduces overall noise production, it also slightly decreases the performance of the drive.",
    "alias" : [
      "Automatic acoustic management",
      "AAM"
    ]
  },
  {
    "key": "As a matter of fact",
    "description": "Shorthand for as a matter of fact, AAMOF is a commonly used saying in text-based communications. Below is an example of how this shorthand could be used.",
    "alias" : [
      "As a matter of fact",
      "AAMOF"
    ]
  },
  {
    "key": "AAS",
    "description": "Short for Auto Area Segmentation, AAS is an OCR technology that helps make a scanned copy clear and easy to read.",
    "alias" : [
      "Auto Area Segmentation",
      "AAS"
    ]
  },
  {
    "key": "AAVID",
    "description": "Aavid Thermalloy is a manufacturer of computer heat sinks for various computer components, including computer processors and video cards. Aavid also manufactures case fans for computer cases. Today, Aavid is a subsidiary of Boyd Corporation.",
    "alias" : [
      "AAVID"
    ]
  },
  {
    "key": "Abacus",
    "description": "Alternatively referred to as the counting frame, an abacus is a mechanical device used to assist a person in performing mathematical calculations and counting.",
    "alias" : [
      "Abacus",
      "Counting Frame"
    ]
  },
  {
    "key": "Abandonware",
    "description": "Alternatively referred to as abandon warez, abandonware is software no longer developed, sold, or supported by the creator.",
    "alias" : [
      "Abandonware",
      "Abandon warez"
    ]
  },
  {
    "key": "A-B box",
    "description": "The A-B box is an analog switch box used to connect multiple peripherals to one computer. The pictures are examples of the front and back of an A-B box. The back of the A-B box has an INPUT-OUTPUT port, and A and B ports to connect each of the devices. In our example, two parallel port printers connect to the box on the A and B ports and the computer connects to the INPUT-OUTPUT port. The computer user could then switch between the A and B printer on the same computer without having to disconnect and reconnect the printers to the computer.",
    "alias" : [
      "A-B box",
      "A-B"
    ]
  },
  {
    "key": "Abbreviation",
    "description": "An abbreviation is a shortened version of a word that is pronounced as individual letters. For example,'HTML' is an abbreviation for 'Hypertext Markup Language' and is pronounced H-T-M-L and not sounded out as a word.",
    "alias" : [
      "Abbrev",
      "Abbreviation"
    ]
  },
  {
    "key": "abbr",
    "description": "When writing in HTML, the <abbr> tag is an inline element used to create an acronym or abbreviation. It is useful when you want to shorten a word or phrase, but still want to give additional information to visitors, search engines, and browsers. The following sections contain information about this tag, including an example of it in use, and related attributes and browser compatibility.",
    "alias" : [
      "abbr",
      "<abbr>",
      "html abbr tag",
      "html <abbr> tag"
    ]
  },
  {
    "key": "ABBYY",
    "description": "Founded in 1997, ABBYY is a developer of AI (Artificial Intelligence) software programs that help in OCR programs and TextGrabber programs. The company has developed such programs as Lingvo, FileReader, and many more.",
    "alias" : [
      "ABBYY"
    ]
  },
  {
    "key": "ABC",
    "description": "Short for Atanasoff-Berry Computer, the ABC is considered the first electronic digital computer and was the first machine to use vacuum tubes (over 300 vacuum tubes). Professor John Vincent Atanasoff and graduate student Cliff Berry developed the ABC in 1937 and continued development until 1942 at the Iowa State College (now Iowa State University). On October 19, 1973, Judge Earl R. Larson concluded that the ENIAC, patent by Eckert and Mauchly was invalid and named Atanasoff the inventor of the first electronic digital computer.",
    "alias" : [
      "Atansaoff-Berry Computer",
      "ABC"
    ]
  },
  {
    "key": "Abend",
    "description": "Short for abnormal end, abend is a term used to describe when a program or task terminates without warning. If an abend occurs, it's followed by an error message indicating the program's last operation and the file or where in the memory the malfunction occurred.",
    "alias" : [
      "Abnormal end",
      "abend"
    ]
  },
  {
    "key": "Aberration",
    "description": "With digital photography, an aberration is an unwanted defect or imperfection in an image. Aberrations are generally caused by a defect or a foreign object on the lens. Examples include a spec of dust, dirt, or another foreign materials. In the image, an aberration is displayed in the red box. This aberration was caused by a tiny crumb on the lens of the camera.",
    "alias" : [
      "Abberation"
    ]
  },
  {
    "key": "Advanced BIOS",
    "description": "Short for Advanced BIOS, ABIOS is capable of supporting calls in protected mode. ABIOS was first used with the IBM PS/2 running the OS/2 operating system but is now included on all new PCs.",
    "alias" : [
      "ABIOS",
      "Advanced BIOS"
    ]
  },
  {
    "key": "Abit",
    "description": "Founded in 1989, ABIT was a manufacturer of computer motherboards, video cards, and other computer accessories.",
    "alias" : [
      "Abit"
    ]
  },
  {
    "key": "AbiWord",
    "description": "AbiWord is a free and open source word processor program that was first released on December 1, 1998, and today resembles other word processors. Its features include many of the same features as other non-free word processors and is capable of saving and opening documents created in Microsoft Word and Corel WordPerfect.",
    "alias" : [
      "AbiWord"
    ]
  },
  {
    "key": "Fully Qualified Domain Name",
    "description": "Alternatively referred to as an ABN (absolute domain name), FQDN is short for fully qualified domain name and is the address name of a computer using DNS. For example, \"www.google.com\" is an example of an FQDN.",
    "alias" : [
      "FQDN",
      "Fully Qualified Domain Name",
      "ABN",
      "Absolute domain name"
    ]
  }
]
